[Killed] EqualityOperator
src/pagination.js:29:6
 	const next = Math.min(pageCount, currentPage + 1);
 
 	let startPage = Math.max(1, currentPage - 2);
-	if (startPage > pageCount - 5) {
+	if (startPage <= pageCount - 5) {
 		startPage -= 2 - (pageCount - currentPage);
 	}
killedBy: All tests
statusReason: .
!

  1 passing (16ms)
  1 failing

[Killed] ConditionalExpression
src/pagination.js:29:6
 	const next = Math.min(pageCount, currentPage + 1);
 
 	let startPage = Math.max(1, currentPage - 2);
-	if (startPage > pageCount - 5) {
+	if (true) {
 		startPage -= 2 - (pageCount - currentPage);
 	}
killedBy: All tests
statusReason: .
!

  1 passing (6ms)
  1 failing


  1) Pagination

[Killed] EqualityOperator
src/pagination.js:67:6
 	queryObj.page = pageCount;
 	data.last = { page: pageCount, active: currentPage === pageCount, qs: qs.stringify(queryObj) };
 
-	if (currentPage < pageCount) {
+	if (currentPage >= pageCount) {
 		data.rel.push({
 			rel: 'next',
killedBy: All tests
statusReason: .!


  1 passing (11ms)

  1 failing
